burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_dma.h
/*!
    \file    gd32m53x_dma.h
    \brief   definitions for the DMA

    \version 2026-03-04, V1.0.0, firmware for GD32M53x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32M53X_DMA_H
#define GD32M53X_DMA_H

#include "gd32m53x.h"

/* DMAx(x=0,1) definitions */
#define DMA0                                    DMA_BASE                       /*!< DMA0 base address */
#define DMA1                                    (DMA_BASE + 0x00000400U)       /*!< DMA1 base address */
/* DMAMUX definitions */
#define DMAMUX                                  DMAMUX_BASE                    /*!< DMA base address */

/* DMAx(x=0,1) registers definitions */
#define DMA_INTF(dmax)                          REG32((dmax) + 0x00000000U)    /*!< DMA interrupt flag register */
#define DMA_INTC(dmax)                          REG32((dmax) + 0x00000004U)    /*!< DMA interrupt flag clear register */
#define DMA_CH0CTL(dmax)                        REG32((dmax) + 0x00000008U)    /*!< DMA channel 0 control register */
#define DMA_CH0CNT(dmax)                        REG32((dmax) + 0x0000000CU)    /*!< DMA channel 0 counter register */
#define DMA_CH0PADDR(dmax)                      REG32((dmax) + 0x00000010U)    /*!< DMA channel 0 peripheral base address register */
#define DMA_CH0MADDR(dmax)                      REG32((dmax) + 0x00000014U)    /*!< DMA channel 0 memory base address register */
#define DMA_CH1CTL(dmax)                        REG32((dmax) + 0x0000001CU)    /*!< DMA channel 1 control register */
#define DMA_CH1CNT(dmax)                        REG32((dmax) + 0x00000020U)    /*!< DMA channel 1 counter register */
#define DMA_CH1PADDR(dmax)                      REG32((dmax) + 0x00000024U)    /*!< DMA channel 1 peripheral base address register */
#define DMA_CH1MADDR(dmax)                      REG32((dmax) + 0x00000028U)    /*!< DMA channel 1 memory base address register */
#define DMA_CH2CTL(dmax)                        REG32((dmax) + 0x00000030U)    /*!< DMA channel 2 control register */
#define DMA_CH2CNT(dmax)                        REG32((dmax) + 0x00000034U)    /*!< DMA channel 2 counter register */
#define DMA_CH2PADDR(dmax)                      REG32((dmax) + 0x00000038U)    /*!< DMA channel 2 peripheral base address register */
#define DMA_CH2MADDR(dmax)                      REG32((dmax) + 0x0000003CU)    /*!< DMA channel 2 memory base address register */
#define DMA_CH3CTL(dmax)                        REG32((dmax) + 0x00000044U)    /*!< DMA channel 3 control register */
#define DMA_CH3CNT(dmax)                        REG32((dmax) + 0x00000048U)    /*!< DMA channel 3 counter register */
#define DMA_CH3PADDR(dmax)                      REG32((dmax) + 0x0000004CU)    /*!< DMA channel 3 peripheral base address register */
#define DMA_CH3MADDR(dmax)                      REG32((dmax) + 0x00000050U)    /*!< DMA channel 3 memory base address register */
#define DMA_CH4CTL(dmax)                        REG32((dmax) + 0x00000058U)    /*!< DMA channel 4 control register */
#define DMA_CH4CNT(dmax)                        REG32((dmax) + 0x0000005CU)    /*!< DMA channel 4 counter register */
#define DMA_CH4PADDR(dmax)                      REG32((dmax) + 0x00000060U)    /*!< DMA channel 4 peripheral base address register */
#define DMA_CH4MADDR(dmax)                      REG32((dmax) + 0x00000064U)    /*!< DMA channel 4 memory base address register */
#define DMA_CH5CTL(dmax)                        REG32((dmax) + 0x0000006CU)    /*!< DMA channel 5 control register */
#define DMA_CH5CNT(dmax)                        REG32((dmax) + 0x00000070U)    /*!< DMA channel 5 counter register */
#define DMA_CH5PADDR(dmax)                      REG32((dmax) + 0x00000074U)    /*!< DMA channel 5 peripheral base address register */
#define DMA_CH5MADDR(dmax)                      REG32((dmax) + 0x00000078U)    /*!< DMA channel 5 memory base address register */

#define DMAMUX_RM_CH0CFG                        REG32(DMAMUX + 0x00000000U)    /*!< DMAMUX request multiplexer channel 0 configuration register */
#define DMAMUX_RM_CH1CFG                        REG32(DMAMUX + 0x00000004U)    /*!< DMAMUX request multiplexer channel 1 configuration register */
#define DMAMUX_RM_CH2CFG                        REG32(DMAMUX + 0x00000008U)    /*!< DMAMUX request multiplexer channel 2 configuration register */
#define DMAMUX_RM_CH3CFG                        REG32(DMAMUX + 0x0000000CU)    /*!< DMAMUX request multiplexer channel 3 configuration register */
#define DMAMUX_RM_CH4CFG                        REG32(DMAMUX + 0x00000010U)    /*!< DMAMUX request multiplexer channel 4 configuration register */
#define DMAMUX_RM_CH5CFG                        REG32(DMAMUX + 0x00000014U)    /*!< DMAMUX request multiplexer channel 5 configuration register */
#define DMAMUX_RM_CH6CFG                        REG32(DMAMUX + 0x00000018U)    /*!< DMAMUX request multiplexer channel 6 configuration register */
#define DMAMUX_RM_CH7CFG                        REG32(DMAMUX + 0x0000001CU)    /*!< DMAMUX request multiplexer channel 7 configuration register */
#define DMAMUX_RM_CH8CFG                        REG32(DMAMUX + 0x00000020U)    /*!< DMAMUX request multiplexer channel 8 configuration register */
#define DMAMUX_RM_CH9CFG                        REG32(DMAMUX + 0x00000024U)    /*!< DMAMUX request multiplexer channel 9 configuration register */
#define DMAMUX_RM_CH10CFG                       REG32(DMAMUX + 0x00000028U)    /*!< DMAMUX request multiplexer channel 10 configuration register */
#define DMAMUX_RM_CH11CFG                       REG32(DMAMUX + 0x0000002CU)    /*!< DMAMUX request multiplexer channel 11 configuration register */

#define DMAMUX_RM_INTF                          REG32(DMAMUX + 0x00000080U)    /*!< DMAMUX request multiplexer channel interrupt flag register */
#define DMAMUX_RM_INTC                          REG32(DMAMUX + 0x00000084U)    /*!< DMAMUX request multiplexer channel interrupt flag clear register */
#define DMAMUX_RG_CH0CFG                        REG32(DMAMUX + 0x00000100U)    /*!< DMAMUX generator channel 0 configuration register */
#define DMAMUX_RG_CH1CFG                        REG32(DMAMUX + 0x00000104U)    /*!< DMAMUX generator channel 1 configuration register */
#define DMAMUX_RG_CH2CFG                        REG32(DMAMUX + 0x00000108U)    /*!< DMAMUX generator channel 2 configuration register */
#define DMAMUX_RG_CH3CFG                        REG32(DMAMUX + 0x0000010CU)    /*!< DMAMUX generator channel 3 configuration register */
#define DMAMUX_RG_INTF                          REG32(DMAMUX + 0x00000140U)    /*!< DMAMUX generator channel interrupt flag register */
#define DMAMUX_RG_INTC                          REG32(DMAMUX + 0x00000144U)    /*!< DMAMUX rgenerator channel interrupt flag clear register */

