burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_dma.h
/* DMAMUX_RG_INTC */
#define DMAMUX_RG_INTF_TOIFC0                   BIT(0)                         /*!< clear bit for trigger overrun event flag of request generator channel 0 */
#define DMAMUX_RG_INTF_TOIFC1                   BIT(1)                         /*!< clear bit for trigger overrun event flag of request generator channel 1 */
#define DMAMUX_RG_INTF_TOIFC2                   BIT(2)                         /*!< clear bit for trigger overrun event flag of request generator channel 2 */
#define DMAMUX_RG_INTF_TOIFC3                   BIT(3)                         /*!< clear bit for trigger overrun event flag of request generator channel 3 */

/* constants definitions */
/* define the DMAMUX bit position and its register index offset */
#define DMAMUX_REGIDX_BIT(regidx, bitpos)                      (((uint32_t)(regidx) << 6U) | (uint32_t)(bitpos))
#define DMAMUX_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)   (((uint32_t)(regidx2) << 22U) | (uint32_t)((bitpos2) << 16U) \
                                                                | (((uint32_t)(regidx) << 6U) | (uint32_t)(bitpos)))

#define DMAMUX_REG_VAL(offset)                                 (REG32(DMAMUX + (((uint32_t)(offset) & 0x0000FFFFU) >> 6U)))
#define DMAMUX_REG_VAL2(offset)                                (REG32(DMAMUX + ((uint32_t)(offset) >> 22U)))
#define DMAMUX_REG_VAL3(offset)                                (REG32(DMAMUX + (((uint32_t)(offset) & 0x0000FFFFU) >> 6U) + 0x4U))

#define DMAMUX_BIT_POS(val)                                    ((uint32_t)(val) & 0x1FU)
#define DMAMUX_BIT_POS2(val)                                   (((uint32_t)(val) & 0x001F0000U) >> 16U)

/* register offset */
#define DMAMUX_RM_CH0CFG_REG_OFFSET       0x00000000U                           /*!< DMAMUX_RM_CH0CFG register offset */
#define DMAMUX_RM_CH1CFG_REG_OFFSET       0x00000004U                           /*!< DMAMUX_RM_CH1CFG register offset */
#define DMAMUX_RM_CH2CFG_REG_OFFSET       0x00000008U                           /*!< DMAMUX_RM_CH2CFG register offset */
#define DMAMUX_RM_CH3CFG_REG_OFFSET       0x0000000CU                           /*!< DMAMUX_RM_CH3CFG register offset */
#define DMAMUX_RM_CH4CFG_REG_OFFSET       0x00000010U                           /*!< DMAMUX_RM_CH4CFG register offset */
#define DMAMUX_RM_CH5CFG_REG_OFFSET       0x00000014U                           /*!< DMAMUX_RM_CH5CFG register offset */
#define DMAMUX_RM_CH6CFG_REG_OFFSET       0x00000018U                           /*!< DMAMUX_RM_CH6CFG register offset */
#define DMAMUX_RM_CH7CFG_REG_OFFSET       0x0000001CU                           /*!< DMAMUX_RM_CH7CFG register offset */
#define DMAMUX_RM_CH8CFG_REG_OFFSET       0x00000020U                           /*!< DMAMUX_RM_CH8CFG register offset */
#define DMAMUX_RM_CH9CFG_REG_OFFSET       0x00000024U                           /*!< DMAMUX_RM_CH9CFG register offset */
#define DMAMUX_RM_CH10CFG_REG_OFFSET      0x00000028U                           /*!< DMAMUX_RM_CH10CFG register offset */
#define DMAMUX_RM_CH11CFG_REG_OFFSET      0x0000002CU                           /*!< DMAMUX_RM_CH11CFG register offset */

#define DMAMUX_RG_CH0CFG_REG_OFFSET       0x00000100U                           /*!< DMAMUX_RG_CH0CFG register offset */
#define DMAMUX_RG_CH1CFG_REG_OFFSET       0x00000104U                           /*!< DMAMUX_RG_CH1CFG register offset */
#define DMAMUX_RG_CH2CFG_REG_OFFSET       0x00000108U                           /*!< DMAMUX_RG_CH2CFG register offset */
#define DMAMUX_RG_CH3CFG_REG_OFFSET       0x0000010CU                           /*!< DMAMUX_RG_CH3CFG register offset */

#define DMAMUX_RM_INTF_REG_OFFSET         0x00000080U                           /*!< DMAMUX_RM_INTF register offset */
#define DMAMUX_RM_INTC_REG_OFFSET         0x00000084U                           /*!< DMAMUX_RM_INTC register offset */
#define DMAMUX_RG_INTF_REG_OFFSET         0x00000140U                           /*!< DMAMUX_RG_INTF register offset */
#define DMAMUX_RG_INTC_REG_OFFSET         0x00000144U                           /*!< DMAMUX_RG_INTC register offset */

/* DMA channel select */
typedef enum {
    DMA_CH0 = 0U,                                                               /*!< DMA Channel 0 */
    DMA_CH1,                                                                    /*!< DMA Channel 1 */
    DMA_CH2,                                                                    /*!< DMA Channel 2 */
    DMA_CH3,                                                                    /*!< DMA Channel 3 */
    DMA_CH4,                                                                    /*!< DMA Channel 4 */
    DMA_CH5,                                                                    /*!< DMA Channel 5 */
} dma_channel_enum;

/* DMAMUX request line multiplexer channel */
typedef enum {
    DMAMUX_MUXCH0 = 0U,                                                          /*!< DMAMUX request multiplexer Channel0 */
    DMAMUX_MUXCH1,                                                              /*!< DMAMUX request multiplexer Channel1 */
    DMAMUX_MUXCH2,                                                              /*!< DMAMUX request multiplexer Channel2 */
    DMAMUX_MUXCH3,                                                              /*!< DMAMUX request multiplexer Channel3 */
    DMAMUX_MUXCH4,                                                              /*!< DMAMUX request multiplexer Channel4 */
    DMAMUX_MUXCH5,                                                              /*!< DMAMUX request multiplexer Channel5 */
    DMAMUX_MUXCH6,                                                              /*!< DMAMUX request multiplexer Channel6 */
    DMAMUX_MUXCH7,                                                              /*!< DMAMUX request multiplexer Channel7 */
    DMAMUX_MUXCH8,                                                              /*!< DMAMUX request multiplexer Channel8 */
    DMAMUX_MUXCH9,                                                              /*!< DMAMUX request multiplexer Channel9 */
    DMAMUX_MUXCH10,                                                             /*!< DMAMUX request multiplexer Channel10 */
    DMAMUX_MUXCH11,                                                             /*!< DMAMUX request multiplexer Channel11 */
} dmamux_multiplexer_channel_enum;

/* DMAMUX request generator channel */
typedef enum {
    DMAMUX_GENCH0 = 0U,                                                         /*!< DMAMUX request generator Channel0 */
    DMAMUX_GENCH1,                                                              /*!< DMAMUX request generator Channel1 */
    DMAMUX_GENCH2,                                                              /*!< DMAMUX request generator Channel2 */
    DMAMUX_GENCH3,                                                              /*!< DMAMUX request generator Channel3 */
} dmamux_generator_channel_enum;

/* DMAMUX interrupt enable or disable */
typedef enum {
    /* interrupts in CHxCFG register */
    DMAMUX_INT_MUXCH0_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH0CFG_REG_OFFSET,  8U),                                /*!< DMAMUX request multiplexer channel 0 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH1_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH1CFG_REG_OFFSET,  8U),                                /*!< DMAMUX request multiplexer channel 1 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH2_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH2CFG_REG_OFFSET,  8U),                                /*!< DMAMUX request multiplexer channel 2 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH3_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH3CFG_REG_OFFSET,  8U),                                /*!< DMAMUX request multiplexer channel 3 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH4_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH4CFG_REG_OFFSET,  8U),                                /*!< DMAMUX request multiplexer channel 4 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH5_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH5CFG_REG_OFFSET,  8U),                                /*!< DMAMUX request multiplexer channel 5 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH6_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH6CFG_REG_OFFSET,  8U),                                /*!< DMAMUX request multiplexer channel 6 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH7_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH7CFG_REG_OFFSET,  8U),                                /*!< DMAMUX request multiplexer channel 7 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH8_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH8CFG_REG_OFFSET,  8U),                                /*!< DMAMUX request multiplexer channel 8 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH9_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH9CFG_REG_OFFSET,  8U),                                /*!< DMAMUX request multiplexer channel 9 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH10_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH10CFG_REG_OFFSET, 8U),                                /*!< DMAMUX request multiplexer channel 10 synchronization overrun interrupt */
    DMAMUX_INT_MUXCH11_SO = DMAMUX_REGIDX_BIT(DMAMUX_RM_CH11CFG_REG_OFFSET, 8U),                                /*!< DMAMUX request multiplexer channel 11 synchronization overrun interrupt */
    DMAMUX_INT_GENCH0_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_CH0CFG_REG_OFFSET,  8U),                                /*!< DMAMUX request generator channel 0 trigger overrun interrupt */
    DMAMUX_INT_GENCH1_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_CH1CFG_REG_OFFSET,  8U),                                /*!< DMAMUX request generator channel 1 trigger overrun interrupt */
    DMAMUX_INT_GENCH2_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_CH2CFG_REG_OFFSET,  8U),                                /*!< DMAMUX request generator channel 2 trigger overrun interrupt */
    DMAMUX_INT_GENCH3_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_CH3CFG_REG_OFFSET,  8U),                                /*!< DMAMUX request generator channel 3 trigger overrun interrupt */
} dmamux_interrupt_enum;

/* DMAMUX flags */
typedef enum {
    /* flags in INTF register */
    DMAMUX_FLAG_MUXCH0_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 0U),                                 /*!< DMAMUX request multiplexer channel 0 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH1_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 1U),                                 /*!< DMAMUX request multiplexer channel 1 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH2_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 2U),                                 /*!< DMAMUX request multiplexer channel 2 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH3_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 3U),                                 /*!< DMAMUX request multiplexer channel 3 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH4_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 4U),                                 /*!< DMAMUX request multiplexer channel 4 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH5_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 5U),                                 /*!< DMAMUX request multiplexer channel 5 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH6_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 6U),                                 /*!< DMAMUX request multiplexer channel 6 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH7_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 7U),                                 /*!< DMAMUX request multiplexer channel 7 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH8_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 8U),                                 /*!< DMAMUX request multiplexer channel 8 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH9_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 9U),                                 /*!< DMAMUX request multiplexer channel 9 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH10_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 10U),                               /*!< DMAMUX request multiplexer channel 10 synchronization overrun flag */
    DMAMUX_FLAG_MUXCH11_SO  = DMAMUX_REGIDX_BIT(DMAMUX_RM_INTF_REG_OFFSET, 11U),                               /*!< DMAMUX request multiplexer channel 11 synchronization overrun flag */
    DMAMUX_FLAG_GENCH0_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_INTF_REG_OFFSET, 0U),                                 /*!< DMAMUX request generator channel 0 trigger overrun flag */
    DMAMUX_FLAG_GENCH1_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_INTF_REG_OFFSET, 1U),                                 /*!< DMAMUX request generator channel 1 trigger overrun flag */
    DMAMUX_FLAG_GENCH2_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_INTF_REG_OFFSET, 2U),                                 /*!< DMAMUX request generator channel 2 trigger overrun flag */
    DMAMUX_FLAG_GENCH3_TO  = DMAMUX_REGIDX_BIT(DMAMUX_RG_INTF_REG_OFFSET, 3U),                                 /*!< DMAMUX request generator channel 3 trigger overrun flag */
} dmamux_flag_enum;

