burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Include/gd32m53x_dma.h
/* DMAMUX request multiplexer channel shift bit */
#define DMAMUX_RM_CHXCFG(channel)          REG32(DMAMUX_RM_CHXCFG_BASE + 0x4U * (uint32_t)(channel))                /*!< the address of DMAMUX channel CHxCFG register */

/* DMAMUX_RG_CHxCFG base address */
#define DMAMUX_RG_CHXCFG_BASE              (DMAMUX + 0x00000100U)                                                   /*!< the base address of DMAMUX channel request generator CHxCFG register */

/* DMAMUX request generator channel shift bit */
#define DMAMUX_RG_CHXCFG(channel)          REG32(DMAMUX_RG_CHXCFG_BASE + 0x4U * (uint32_t)(channel))                /*!< the address of DMAMUX channel request generator CHxCFG register */

/* DMA interrupt flag bits */
#define DMA_INT_FLAG_G                     DMA_INTF_GIF                                    /*!< global interrupt flag of channel */
#define DMA_INT_FLAG_FTF                   DMA_INTF_FTFIF                                  /*!< full transfer finish interrupt flag of channel */
#define DMA_INT_FLAG_HTF                   DMA_INTF_HTFIF                                  /*!< half transfer finish interrupt flag of channel */
#define DMA_INT_FLAG_ERR                   DMA_INTF_ERRIF                                  /*!< error interrupt flag of channel */

/* DMA flag bits */
#define DMA_FLAG_G                         DMA_INTF_GIF                                    /*!< global interrupt flag of channel */
#define DMA_FLAG_FTF                       DMA_INTF_FTFIF                                  /*!< full transfer finish flag of channel */
#define DMA_FLAG_HTF                       DMA_INTF_HTFIF                                  /*!< half transfer finish flag of channel */
#define DMA_FLAG_ERR                       DMA_INTF_ERRIF                                  /*!< error flag of channel */

/* DMA interrupt enable bits */
#define DMA_INT_FTF                        DMA_CHXCTL_FTFIE                                /*!< enable bit for channel full transfer finish interrupt */
#define DMA_INT_HTF                        DMA_CHXCTL_HTFIE                                /*!< enable bit for channel half transfer finish interrupt */
#define DMA_INT_ERR                        DMA_CHXCTL_ERRIE                                /*!< enable bit for channel error interrupt */

/* DMA transfer direction */
#define DMA_PERIPHERAL_TO_MEMORY           ((uint8_t)0x00U)                                /*!< read from peripheral and write to memory */
#define DMA_MEMORY_TO_PERIPHERAL           ((uint8_t)0x01U)                                /*!< read from memory and write to peripheral */

/* DMA peripheral increasing mode */
#define DMA_PERIPH_INCREASE_DISABLE        ((uint32_t)0x00U)                               /*!< next address of peripheral is fixed address mode */
#define DMA_PERIPH_INCREASE_ENABLE         ((uint32_t)0x01U)                               /*!< next address of peripheral is increasing address mode */

/* DMA memory increasing mode */
#define DMA_MEMORY_INCREASE_DISABLE        ((uint32_t)0x00U)                               /*!< next address of memory is fixed address mode */
#define DMA_MEMORY_INCREASE_ENABLE         ((uint32_t)0x01U)                               /*!< next address of memory is increasing address mode */

/* DMA transfer data size of peripheral */
#define CHCTL_PWIDTH(regval)               (BITS(8,9) & ((regval) << 8U))                  /*!< transfer data size of peripheral */
#define DMA_PERIPHERAL_WIDTH_8BIT          CHCTL_PWIDTH(0U)                                /*!< transfer data size of peripheral is 8-bit */
#define DMA_PERIPHERAL_WIDTH_16BIT         CHCTL_PWIDTH(1U)                                /*!< transfer data size of peripheral is 16-bit */
#define DMA_PERIPHERAL_WIDTH_32BIT         CHCTL_PWIDTH(2U)                                /*!< transfer data size of peripheral is 32-bit */

/* DMA transfer data size of memory */
#define CHCTL_MWIDTH(regval)               (BITS(10,11) & ((regval) << 10U))               /*!< transfer data size of memory */
#define DMA_MEMORY_WIDTH_8BIT              CHCTL_MWIDTH(0U)                                /*!< transfer data size of memory is 8-bit */
#define DMA_MEMORY_WIDTH_16BIT             CHCTL_MWIDTH(1U)                                /*!< transfer data size of memory is 16-bit */
#define DMA_MEMORY_WIDTH_32BIT             CHCTL_MWIDTH(2U)                                /*!< transfer data size of memory is 32-bit */

/* DMA channel priority level */
#define CHCTL_PRIO(regval)                 (BITS(12,13) & ((regval) << 12U))               /*!< DMA channel priority level */
#define DMA_PRIORITY_LOW                   CHCTL_PRIO(0U)                                  /*!< low priority */
#define DMA_PRIORITY_MEDIUM                CHCTL_PRIO(1U)                                  /*!< medium priority */
#define DMA_PRIORITY_HIGH                  CHCTL_PRIO(2U)                                  /*!< high priority */
#define DMA_PRIORITY_ULTRA_HIGH            CHCTL_PRIO(3U)                                  /*!< ultra high priority */

/* DMA transfer counter */
#define DMA_CHANNEL_CNT_MASK               DMA_CHXCNT_CNT                                  /*!< transfer counter mask */

/* DMAMUX request multiplexer channel input identification */
#define RM_CHXCFG_MUXID(regval)            (BITS(0,6) & ((regval) << 0U))                  /*!< multiplexer input identification */
#define DMA_REQUEST_M2M                    RM_CHXCFG_MUXID(0U)                             /*!< memory to memory transfer */
#define DMA_REQUEST_GENERATOR0             RM_CHXCFG_MUXID(1U)                             /*!< DMAMUX request generator 0 */
#define DMA_REQUEST_GENERATOR1             RM_CHXCFG_MUXID(2U)                             /*!< DMAMUX request generator 1 */
#define DMA_REQUEST_GENERATOR2             RM_CHXCFG_MUXID(3U)                             /*!< DMAMUX request generator 2 */
#define DMA_REQUEST_GENERATOR3             RM_CHXCFG_MUXID(4U)                             /*!< DMAMUX request generator 3 */
#define DMA_REQUEST_ADC0_A                 RM_CHXCFG_MUXID(5U)                             /*!< DMAMUX ADC0_A request */
#define DMA_REQUEST_ADC2_A                 RM_CHXCFG_MUXID(6U)                             /*!< DMAMUX ADC2_A request */
#define DMA_REQUEST_ADC0_B                 RM_CHXCFG_MUXID(7U)                             /*!< DMAMUX ADC0_B request */
#define DMA_REQUEST_ADC2_B                 RM_CHXCFG_MUXID(8U)                             /*!< DMAMUX ADC2_B request */
#define DMA_REQUEST_ADC0_C                 RM_CHXCFG_MUXID(9U)                             /*!< DMAMUX ADC0_C request */
#define DMA_REQUEST_ADC2_C                 RM_CHXCFG_MUXID(10U)                            /*!< DMAMUX ADC2_C request */
#define DMA_REQUEST_I2C_RX                 RM_CHXCFG_MUXID(11U)                            /*!< DMAMUX I2C RX request */
#define DMA_REQUEST_I2C_TX                 RM_CHXCFG_MUXID(12U)                            /*!< DMAMUX I2C TX request */
#define DMA_REQUEST_UART0_RX               RM_CHXCFG_MUXID(13U)                            /*!< DMAMUX UART0 RX request */
#define DMA_REQUEST_UART0_TX               RM_CHXCFG_MUXID(14U)                            /*!< DMAMUX UART0 TX request */
#define DMA_REQUEST_UART1_RX               RM_CHXCFG_MUXID(15U)                            /*!< DMAMUX UART1 RX request */
#define DMA_REQUEST_UART1_TX               RM_CHXCFG_MUXID(16U)                            /*!< DMAMUX UART1 TX request */
#define DMA_REQUEST_UART2_RX               RM_CHXCFG_MUXID(17U)                            /*!< DMAMUX UART2 RX request */
#define DMA_REQUEST_UART2_TX               RM_CHXCFG_MUXID(18U)                            /*!< DMAMUX UART2 TX request */
#define DMA_REQUEST_UART3_RX               RM_CHXCFG_MUXID(19U)                            /*!< DMAMUX UART3 RX request */
#define DMA_REQUEST_UART3_TX               RM_CHXCFG_MUXID(20U)                            /*!< UART3 TX request */
#define DMA_REQUEST_SPI0_RX                RM_CHXCFG_MUXID(21U)                            /*!< DMAMUX SPI0 RX request */
#define DMA_REQUEST_SPI0_TX                RM_CHXCFG_MUXID(22U)                            /*!< DMAMUX SPI0 TX request */
#define DMA_REQUEST_TIMER0_UP              RM_CHXCFG_MUXID(23U)                            /*!< DMAMUX TIMER0 UP request */
#define DMA_REQUEST_TIMER0_CMT             RM_CHXCFG_MUXID(24U)                            /*!< DMAMUX TIMER0 CMT request */
#define DMA_REQUEST_TIMER0_TRG             RM_CHXCFG_MUXID(25U)                            /*!< DMAMUX TIMER0 TRG request */
#define DMA_REQUEST_TIMER0_CH0             RM_CHXCFG_MUXID(26U)                            /*!< DMAMUX TIMER0 CH0 request */
#define DMA_REQUEST_TIMER0_CH1             RM_CHXCFG_MUXID(27U)                            /*!< DMAMUX TIMER0 CH1 request */
#define DMA_REQUEST_TIMER0_CH2             RM_CHXCFG_MUXID(28U)                            /*!< DMAMUX TIMER0 CH2 request */
#define DMA_REQUEST_TIMER0_CH3             RM_CHXCFG_MUXID(29U)                            /*!< DMAMUX TIMER0 CH3 request */
#define DMA_REQUEST_TIMER0_MCH0            RM_CHXCFG_MUXID(30U)                            /*!< DMAMUX TIMER0 MCH0 request */
#define DMA_REQUEST_TIMER0_MCH1            RM_CHXCFG_MUXID(31U)                            /*!< DMAMUX TIMER0 MCH1 request */
#define DMA_REQUEST_TIMER0_MCH2            RM_CHXCFG_MUXID(32U)                            /*!< DMAMUX TIMER0 MCH2 request */
#define DMA_REQUEST_TIMER0_MCH3            RM_CHXCFG_MUXID(33U)                            /*!< DMAMUX TIMER0 MCH3 request */
#define DMA_REQUEST_TIMER7_UP              RM_CHXCFG_MUXID(34U)                            /*!< DMAMUX TIMER7 UP request */
#define DMA_REQUEST_TIMER7_CMT             RM_CHXCFG_MUXID(35U)                            /*!< DMAMUX TIMER7 CMT request */
#define DMA_REQUEST_TIMER7_TRG             RM_CHXCFG_MUXID(36U)                            /*!< DMAMUX TIMER7 TRG request */
#define DMA_REQUEST_TIMER7_CH0             RM_CHXCFG_MUXID(37U)                            /*!< DMAMUX TIMER7 CH0 request */
#define DMA_REQUEST_TIMER7_CH1             RM_CHXCFG_MUXID(38U)                            /*!< DMAMUX TIMER7 CH1 request */
#define DMA_REQUEST_TIMER7_CH2             RM_CHXCFG_MUXID(39U)                            /*!< DMAMUX TIMER7 CH2 request */
#define DMA_REQUEST_TIMER7_CH3             RM_CHXCFG_MUXID(40U)                            /*!< DMAMUX TIMER7 CH3 request */
#define DMA_REQUEST_TIMER7_MCH0            RM_CHXCFG_MUXID(41U)                            /*!< DMAMUX TIMER7 MCH0 request */
#define DMA_REQUEST_TIMER7_MCH1            RM_CHXCFG_MUXID(42U)                            /*!< DMAMUX TIMER7 MCH1 request */
#define DMA_REQUEST_TIMER7_MCH2            RM_CHXCFG_MUXID(43U)                            /*!< DMAMUX TIMER7 MCH2 request */
#define DMA_REQUEST_TIMER7_MCH3            RM_CHXCFG_MUXID(44U)                            /*!< DMAMUX TIMER7 MCH3 request */
#define DMA_REQUEST_TIMER1_UP              RM_CHXCFG_MUXID(45U)                            /*!< DMAMUX TIMER1 UP request */
#define DMA_REQUEST_TIMER1_TRG             RM_CHXCFG_MUXID(46U)                            /*!< DMAMUX TIMER1 TRG request */
#define DMA_REQUEST_TIMER1_CH0             RM_CHXCFG_MUXID(47U)                            /*!< DMAMUX TIMER1 CH0 request */
#define DMA_REQUEST_TIMER1_CH1             RM_CHXCFG_MUXID(48U)                            /*!< DMAMUX TIMER1 CH1 request */
#define DMA_REQUEST_TIMER1_CH2             RM_CHXCFG_MUXID(49U)                            /*!< DMAMUX TIMER1 CH2 request */
#define DMA_REQUEST_TIMER1_CH3             RM_CHXCFG_MUXID(50U)                            /*!< DMAMUX TIMER1 CH3 request */
#define DMA_REQUEST_TIMER2_UP              RM_CHXCFG_MUXID(51U)                            /*!< DMAMUX TIMER2 UP request */
#define DMA_REQUEST_TIMER2_TRG             RM_CHXCFG_MUXID(52U)                            /*!< DMAMUX TIMER2 TRG request */
#define DMA_REQUEST_TIMER2_CH0             RM_CHXCFG_MUXID(53U)                            /*!< DMAMUX TIMER2 CH0 request */
#define DMA_REQUEST_TIMER2_CH1             RM_CHXCFG_MUXID(54U)                            /*!< DMAMUX TIMER2 CH1 request */
#define DMA_REQUEST_TIMER2_CH2             RM_CHXCFG_MUXID(55U)                            /*!< DMAMUX TIMER2 CH2 request */
#define DMA_REQUEST_TIMER2_CH3             RM_CHXCFG_MUXID(56U)                            /*!< DMAMUX TIMER2 CH3 request */
#define DMA_REQUEST_TMU_OUTPUT             RM_CHXCFG_MUXID(57U)                            /*!< DMAMUX TMU OUTPUT request */
#define DMA_REQUEST_TMU_INPUT              RM_CHXCFG_MUXID(58U)                            /*!< DMAMUX TMU INPUT request */
#define DMA_REQUEST_GPTIMER0_UP            RM_CHXCFG_MUXID(59U)                            /*!< DMAMUX GPTIMER0 UP request */
#define DMA_REQUEST_GPTIMER0_PRD           RM_CHXCFG_MUXID(60U)                            /*!< DMAMUX GPTIMER0 PRD request */
#define DMA_REQUEST_GPTIMER0_CH0           RM_CHXCFG_MUXID(61U)                            /*!< DMAMUX GPTIMER0 CH0 request */
#define DMA_REQUEST_GPTIMER0_CH1           RM_CHXCFG_MUXID(62U)                            /*!< DMAMUX GPTIMER0 CH1 request */
#define DMA_REQUEST_GPTIMER1_UP            RM_CHXCFG_MUXID(63U)                            /*!< DMAMUX GPTIMER1 UP request */
#define DMA_REQUEST_GPTIMER1_PRD           RM_CHXCFG_MUXID(64U)                            /*!< DMAMUX GPTIMER1 PRD request */
#define DMA_REQUEST_GPTIMER1_CH0           RM_CHXCFG_MUXID(65U)                            /*!< DMAMUX GPTIMER1 CH0 request */
#define DMA_REQUEST_GPTIMER1_CH1           RM_CHXCFG_MUXID(66U)                            /*!< DMAMUX GPTIMER1 CH1 request */
#define DMA_REQUEST_EVIC0                  RM_CHXCFG_MUXID(67U)                            /*!< DMAMUX EVIC0 request */
#define DMA_REQUEST_EVIC1                  RM_CHXCFG_MUXID(68U)                            /*!< DMAMUX EVIC1 request */
#define DMA_REQUEST_EVIC2                  RM_CHXCFG_MUXID(69U)                            /*!< DMAMUX EVIC2 request */
#define DMA_REQUEST_EVIC3                  RM_CHXCFG_MUXID(70U)                            /*!< DMAMUX EVIC3 request */
#define DMA_REQUEST_EVIC4                  RM_CHXCFG_MUXID(71U)                            /*!< DMAMUX EVIC4 request */
#define DMA_REQUEST_EVIC5                  RM_CHXCFG_MUXID(72U)                            /*!< DMAMUX EVIC5 request */
#define DMA_REQUEST_EVIC6                  RM_CHXCFG_MUXID(73U)                            /*!< DMAMUX EVIC6 request */
#define DMA_REQUEST_EVIC7                  RM_CHXCFG_MUXID(74U)                            /*!< DMAMUX EVIC7 request */
#define DMA_REQUEST_EVIC8                  RM_CHXCFG_MUXID(75U)                            /*!< DMAMUX EVIC8 request */
#define DMA_REQUEST_EVIC9                  RM_CHXCFG_MUXID(76U)                            /*!< DMAMUX EVIC9 request */
#define DMA_REQUEST_ADC0_D                 RM_CHXCFG_MUXID(77U)                            /*!< DMAMUX ADC0_D request */
#define DMA_REQUEST_ADC2_D                 RM_CHXCFG_MUXID(78U)                            /*!< DMAMUX ADC2_D request */
#define DMA_REQUEST_GPTIMER0_CH0COMV_ADD   RM_CHXCFG_MUXID(79U)                            /*!< DMAMUX GPTIMER0 CH0COMV ADD request */
#define DMA_REQUEST_GPTIMER0_CH1COMV_ADD   RM_CHXCFG_MUXID(80U)                            /*!< DMAMUX GPTIMER0 CH1COMV ADD request */
#define DMA_REQUEST_GPTIMER1_CH0COMV_ADD   RM_CHXCFG_MUXID(81U)                            /*!< DMAMUX GPTIMER1 CH0COMV ADD request */
#define DMA_REQUEST_GPTIMER1_CH1COMV_ADD   RM_CHXCFG_MUXID(82U)                            /*!< DMAMUX GPTIMER1 CH1COMV ADD request */
#define DMA_REQUEST_EVIC10                 RM_CHXCFG_MUXID(83U)                            /*!< DMAMUX EVIC10 request */
#define DMA_REQUEST_EVIC11                 RM_CHXCFG_MUXID(84U)                            /*!< DMAMUX EVIC11 request */


/* DMAMUX request generator trigger input identification */
#define RG_CHXCFG_TID(regval)              (BITS(0,4) & ((regval) << 0U))                  /*!< trigger input identification */
#define DMAMUX_TRIGGER_EXTI0               RG_CHXCFG_TID(0U)                               /*!< trigger input is EXTI0 */
#define DMAMUX_TRIGGER_EXTI1               RG_CHXCFG_TID(1U)                               /*!< trigger input is EXTI1 */
#define DMAMUX_TRIGGER_EXTI2               RG_CHXCFG_TID(2U)                               /*!< trigger input is EXTI2 */
#define DMAMUX_TRIGGER_EXTI3               RG_CHXCFG_TID(3U)                               /*!< trigger input is EXTI3 */
#define DMAMUX_TRIGGER_EXTI4               RG_CHXCFG_TID(4U)                               /*!< trigger input is EXTI4 */
#define DMAMUX_TRIGGER_EXTI5               RG_CHXCFG_TID(5U)                               /*!< trigger input is EXTI5 */
#define DMAMUX_TRIGGER_EXTI6               RG_CHXCFG_TID(6U)                               /*!< trigger input is EXTI6 */
#define DMAMUX_TRIGGER_EXTI7               RG_CHXCFG_TID(7U)                               /*!< trigger input is EXTI7 */
#define DMAMUX_TRIGGER_EXTI8               RG_CHXCFG_TID(8U)                               /*!< trigger input is EXTI8 */
#define DMAMUX_TRIGGER_EXTI9               RG_CHXCFG_TID(9U)                               /*!< trigger input is EXTI9 */
#define DMAMUX_TRIGGER_EXTI10              RG_CHXCFG_TID(10U)                              /*!< trigger input is EXTI10 */
#define DMAMUX_TRIGGER_EXTI11              RG_CHXCFG_TID(11U)                              /*!< trigger input is EXTI11 */
#define DMAMUX_TRIGGER_EXTI12              RG_CHXCFG_TID(12U)                              /*!< trigger input is EXTI12 */
#define DMAMUX_TRIGGER_EXTI13              RG_CHXCFG_TID(13U)                              /*!< trigger input is EXTI13 */
#define DMAMUX_TRIGGER_EXTI14              RG_CHXCFG_TID(14U)                              /*!< trigger input is EXTI14 */
#define DMAMUX_TRIGGER_EXTI15              RG_CHXCFG_TID(15U)                              /*!< trigger input is EXTI15 */
#define DMAMUX_TRIGGER_EVTX_OUT0           RG_CHXCFG_TID(16U)                              /*!< trigger input is Evtx_out0 */
#define DMAMUX_TRIGGER_EVTX_OUT1           RG_CHXCFG_TID(17U)                              /*!< trigger input is Evtx_out1 */
#define DMAMUX_TRIGGER_EVTX_OUT2           RG_CHXCFG_TID(18U)                              /*!< trigger input is Evtx_out2 */
#define DMAMUX_TRIGGER_EVTX_OUT3           RG_CHXCFG_TID(19U)                              /*!< trigger input is Evtx_out3 */

